'''src/solution.py
Выведите на экран строку 2 times, полученную из числа 2 и строки times, 
используя преобразования типов и конкатенацию:

2 times'''

print('2' + ' times')
print(str(2) + ' times')
print()











