

def print_motto():
    print('Winter is coming')

# Вопрос: 1 из 4. Правильных ответов: 0
''' Выберите верные утверждения:
   (нужно выбрать все корректные ответы)'''

#  В Python нет возможности имплементировать собственные функции
#  Функции усложняют код за счёт дополнительного синтаксиса, который нужно помнить
'''Функции позволяют скрыть сложность какой-то составной операции
   Функции позволяют объединить несколько составных операций в одну
   Функции упрощают разработку и поддержку программ'''

#  Вопрос: 2 из 4. Правильных ответов: 1
#  Какая ошибка допущена в коде?

# say_hello():
# print("Hello, Hexlet!")

'''Определение функции должно начинаться с ключевого слова def'''
#  Функция ничего не возвращает
#  Функция say_hello() не принимает никаких аргументов

#  Вопрос: 3 из 4. Правильных ответов: 2
#  В какой момент происходит выполнение кода записанного в теле функции?

#  Код выполняется сразу же по мере чтения функции интерпретатором
'''В момент её вызова'''
#  В момент повторного перевода строки, который закрывает тело функции

#  Вопрос: 4 из 4. Правильных ответов: 3
#  Как лучше именовать функции?

# (нужно выбрать все корректные ответы)

#  Имя должно совпадать с именем файла, в котором определена функция
#  Лучше давать понятные названия, которые отражают суть операции, которую реализует функция
'''Практически всегда имена должны быть глаголом'''
#  Не имеет значения'''

def print_motto():
    print('Winter is coming')
print_motto()
'''================================================================================='''

#  src/solution.py
'''Реализуйте функцию print_motto(), 
которая печатает на экран фразу Winter is coming:
print_motto()  # => Winter is coming
Важное замечание! 
В задачах, в которых нужно реализовать функцию, эту функцию вызывать не нужно. 
Вызывать функцию будут автоматизированные тесты, которые проверяют её работоспособность. Пример с вызовом выше показан только для того, чтобы вы понимали, как ваша функция будет использоваться.'''

def print_motto():
    print('Winter is coming')



