# packages
# пакеты

'''
Вопрос: 1 из 3. 
Минимальный пакет это

  директория с модулем __init__.py'''
# просто директория
# 10 минут + 10 SMS
# директория с модулями
# директория с модулем __init__.py
# просто модуль'''
'''
Вопрос: 2 из 3. 
Пакет всегда
(нужно выбрать все корректные ответы)

Содержит модуль __init__.py 
Называется в стиле "snake_case" '''
# Сделан из полиэтилена или бумаги
# Называется в стиле "snake_case"
# Называется "package"
# Имеет расширение ".py"
# Имеет две ручки
'''
Вопрос: 3 из 3. Правильных ответов: 2
Какой из видов импортирования мы рекомендуем использовать?

  абсолютные импорты'''
# относительные импорты

print('src/package/init.py')
'''
Дан пакет следующей структуры:

$ tree package
package/
├── __init__.py
├── functions.py
└── names.py
Добавьте в __init__.py константу GREETING, 
которая должна содержать результат применения функции greet() к константе NAME 
(и та, и другая импортируются из модулей пакета в блоке импортов модуля __init__.py).
'''












