'''
Чтобы попрактиковаться, попробуем создать свой модуль. 
Для этого мы создадим файл с названием greeting.py. 
Затем внутри этого файла определим функцию say_hi() и переменную name:
'''

def say_hi(): # определяем функцию
    print('Hi!')
name = 'Bob' # определяем переменнную

'''
===> Чтобы воспользоваться нашим модулем, нужно импортировать его в главный модуль main.py. <===

Для этого в Python есть три способа:

1. Импорт модуля целиком
2. Импорт отдельных определений из модуля
3. Импорт всего содержимого модуля сразу

Здесь мы рассмотрим только первый и второй способ, а третий обсудим подробно уже в следующем уроке.
'''




